output-lean/docs/diagrams/landscape.dot
digraph dependencies {
    rankdir=LR;
    node [shape=box, style=filled, fontname="Helvetica"];
    edge [color="#666666"];

    subgraph cluster_0 {
        label="webapps"; style=filled; color="#EEEEEE";
        Lean_QuantConnect_Api [label="QuantConnect.Api", fillcolor="#1ABC9C", fontcolor="white"];
    }
    subgraph cluster_1 {
        label="librarys"; style=filled; color="#EEEEEE";
        Lean_QuantConnect_Configuration [label="QuantConnect.Configuration", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Compression [label="QuantConnect.Compression", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Messaging [label="QuantConnect.Messaging", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Research [label="QuantConnect.Research", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Brokerages [label="QuantConnect.Brokerages", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Algorithm_CSharp [label="QuantConnect.Algorithm.CSharp", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Algorithm_Framework [label="QuantConnect.Algorithm.Framework", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Lean_Engine [label="QuantConnect.Lean.Engine", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Queues [label="QuantConnect.Queues", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_AlgorithmFactory [label="QuantConnect.AlgorithmFactory", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect [label="QuantConnect", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Indicators [label="QuantConnect.Indicators", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Optimizer [label="QuantConnect.Optimizer", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Algorithm_Python [label="QuantConnect.Algorithm.Python", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Logging [label="QuantConnect.Logging", fillcolor="#4A90D9", fontcolor="white"];
        Lean_QuantConnect_Algorithm [label="QuantConnect.Algorithm", fillcolor="#4A90D9", fontcolor="white"];
    }
    subgraph cluster_2 {
        label="applications"; style=filled; color="#EEEEEE";
        Lean_QuantConnect_Optimizer_Launcher [label="QuantConnect.Optimizer.Launcher", fillcolor="#E74C3C", fontcolor="white"];
        Lean_QuantConnect_DownloaderDataProvider_Launcher [label="QuantConnect.DownloaderDataProvider.Launcher", fillcolor="#E74C3C", fontcolor="white"];
        Lean_QuantConnect_Lean_Launcher [label="QuantConnect.Lean.Launcher", fillcolor="#E74C3C", fontcolor="white"];
        Lean_QuantConnect_Report [label="QuantConnect.Report", fillcolor="#E74C3C", fontcolor="white"];
    }
    subgraph cluster_3 {
        label="tools"; style=filled; color="#EEEEEE";
        Lean_QuantConnect_ToolBox [label="QuantConnect.ToolBox", fillcolor="#F39C12", fontcolor="white"];
    }
    subgraph cluster_4 {
        label="tests"; style=filled; color="#EEEEEE";
        Lean_QuantConnect_Tests [label="QuantConnect.Tests", fillcolor="#9B59B6", fontcolor="white"];
    }
    Lean_QuantConnect_Api -> Lean_QuantConnect;
    Lean_QuantConnect_Api -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Api -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Configuration -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Compression -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Optimizer_Launcher -> Lean_QuantConnect;
    Lean_QuantConnect_Optimizer_Launcher -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Optimizer_Launcher -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Optimizer_Launcher -> Lean_QuantConnect_Optimizer;
    Lean_QuantConnect_Messaging -> Lean_QuantConnect;
    Lean_QuantConnect_Messaging -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Messaging -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Algorithm_Framework;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Api;
    Lean_QuantConnect_Research -> Lean_QuantConnect;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Lean_Engine;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Research -> Lean_QuantConnect_Queues;
    Lean_QuantConnect_Brokerages -> Lean_QuantConnect_Api;
    Lean_QuantConnect_Brokerages -> Lean_QuantConnect;
    Lean_QuantConnect_Brokerages -> Lean_QuantConnect_Compression;
    Lean_QuantConnect_Brokerages -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Brokerages -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_DownloaderDataProvider_Launcher -> Lean_QuantConnect;
    Lean_QuantConnect_DownloaderDataProvider_Launcher -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_DownloaderDataProvider_Launcher -> Lean_QuantConnect_Lean_Engine;
    Lean_QuantConnect_DownloaderDataProvider_Launcher -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Algorithm_CSharp -> Lean_QuantConnect_Algorithm_Framework;
    Lean_QuantConnect_Algorithm_CSharp -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Algorithm_CSharp -> Lean_QuantConnect;
    Lean_QuantConnect_Algorithm_CSharp -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Algorithm_Framework -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Algorithm_Framework -> Lean_QuantConnect;
    Lean_QuantConnect_Algorithm_Framework -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Algorithm_CSharp;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_AlgorithmFactory;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Api;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Brokerages;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Compression;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect;
    Lean_QuantConnect_Lean_Engine -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Queues -> Lean_QuantConnect_Brokerages;
    Lean_QuantConnect_Queues -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Queues -> Lean_QuantConnect;
    Lean_QuantConnect_Queues -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_AlgorithmFactory -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_AlgorithmFactory -> Lean_QuantConnect;
    Lean_QuantConnect_AlgorithmFactory -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_AlgorithmFactory -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_ToolBox -> Lean_QuantConnect_Lean_Engine;
    Lean_QuantConnect -> Lean_QuantConnect_Compression;
    Lean_QuantConnect -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Algorithm_CSharp;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Algorithm_Framework;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_AlgorithmFactory;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Api;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Brokerages;
    Lean_QuantConnect_Tests -> Lean_QuantConnect;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Compression;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_DownloaderDataProvider_Launcher;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Lean_Engine;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Optimizer;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Research;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Lean_Launcher;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Messaging;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Queues;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_Report;
    Lean_QuantConnect_Tests -> Lean_QuantConnect_ToolBox;
    Lean_QuantConnect_Indicators -> Lean_QuantConnect;
    Lean_QuantConnect_Indicators -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Optimizer -> Lean_QuantConnect;
    Lean_QuantConnect_Optimizer -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Optimizer -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Algorithm_Python -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Algorithm_Python -> Lean_QuantConnect;
    Lean_QuantConnect_Algorithm_Python -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Algorithm_CSharp;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_AlgorithmFactory;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Api;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Brokerages;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Compression;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_DownloaderDataProvider_Launcher;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Lean_Engine;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Optimizer_Launcher;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Research;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Messaging;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_Queues;
    Lean_QuantConnect_Lean_Launcher -> Lean_QuantConnect_ToolBox;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Algorithm;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Api;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Brokerages;
    Lean_QuantConnect_Report -> Lean_QuantConnect;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Lean_Engine;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Logging;
    Lean_QuantConnect_Report -> Lean_QuantConnect_Messaging;
    Lean_QuantConnect_Report -> Lean_QuantConnect_ToolBox;
    Lean_QuantConnect_Algorithm -> Lean_QuantConnect_Configuration;
    Lean_QuantConnect_Algorithm -> Lean_QuantConnect_Indicators;
    Lean_QuantConnect_Algorithm -> Lean_QuantConnect;
    Lean_QuantConnect_Algorithm -> Lean_QuantConnect_Logging;
}
